apache/nuttx/arch/arm/src/kinetis/hardware/kinetis_k64pinmux.h
/* Real-Time Clock (RTC) */

#define PIN_RTC_CLKOUT_1          (PIN_ALT6   | PIN_PORTE | PIN26)
#define PIN_RTC_CLKOUT_2          (PIN_ALT7   | PIN_PORTE | PIN0)

/* Secured digital host controller (SDHC) */

#define PIN_SDHC0_CLKIN           (PIN_ALT4   | PIN_PORTD | PIN11)
#define PIN_SDHC0_CMD             (PIN_ALT4   | PIN_PORTE | PIN3)
#define PIN_SDHC0_D0              (PIN_ALT4   | PIN_PORTE | PIN1)
#define PIN_SDHC0_D1              (PIN_ALT4   | PIN_PORTE | PIN0)
#define PIN_SDHC0_D2              (PIN_ALT4   | PIN_PORTE | PIN5)
#define PIN_SDHC0_D3              (PIN_ALT4   | PIN_PORTE | PIN4)
#define PIN_SDHC0_D4              (PIN_ALT4   | PIN_PORTD | PIN12)
#define PIN_SDHC0_D5              (PIN_ALT4   | PIN_PORTD | PIN13)
#define PIN_SDHC0_D6              (PIN_ALT4   | PIN_PORTD | PIN14)
#define PIN_SDHC0_D7              (PIN_ALT4   | PIN_PORTD | PIN15)
#define PIN_SDHC0_DCLK            (PIN_ALT4   | PIN_PORTE | PIN2)

/* SPI */

#define PIN_SPI0_PCS0_1           (PIN_ALT2   | PIN_PORTA | PIN14)
#define PIN_SPI0_PCS0_2           (PIN_ALT2   | PIN_PORTC | PIN4)
#define PIN_SPI0_PCS0_3           (PIN_ALT2   | PIN_PORTD | PIN0)
#define PIN_SPI0_PCS1_1           (PIN_ALT2   | PIN_PORTC | PIN3)
#define PIN_SPI0_PCS1_2           (PIN_ALT2   | PIN_PORTD | PIN4)
#define PIN_SPI0_PCS2_1           (PIN_ALT2   | PIN_PORTC | PIN2)
#define PIN_SPI0_PCS2_3           (PIN_ALT2   | PIN_PORTD | PIN5)
#define PIN_SPI0_PCS3_1           (PIN_ALT2   | PIN_PORTC | PIN1)
#define PIN_SPI0_PCS3_2           (PIN_ALT2   | PIN_PORTD | PIN6)
#define PIN_SPI0_PCS4             (PIN_ALT2   | PIN_PORTC | PIN0)
#define PIN_SPI0_PCS5             (PIN_ALT3   | PIN_PORTB | PIN23)
#define PIN_SPI0_SCK_1            (PIN_ALT2   | PIN_PORTA | PIN15)
#define PIN_SPI0_SCK_2            (PIN_ALT2   | PIN_PORTC | PIN5)
#define PIN_SPI0_SCK_3            (PIN_ALT2   | PIN_PORTD | PIN1)
#define PIN_SPI0_SIN_1            (PIN_ALT2   | PIN_PORTA | PIN17)
#define PIN_SPI0_SIN_2            (PIN_ALT2   | PIN_PORTC | PIN7)
#define PIN_SPI0_SIN_3            (PIN_ALT2   | PIN_PORTD | PIN3)
#define PIN_SPI0_SOUT_1           (PIN_ALT2   | PIN_PORTA | PIN16)
#define PIN_SPI0_SOUT_2           (PIN_ALT2   | PIN_PORTC | PIN6)
#define PIN_SPI0_SOUT_3           (PIN_ALT2   | PIN_PORTD | PIN2)

#define PIN_SPI1_PCS0_1           (PIN_ALT2   | PIN_PORTB | PIN10)
#define PIN_SPI1_PCS0_2           (PIN_ALT2   | PIN_PORTE | PIN4)
#define PIN_SPI1_PCS0_3           (PIN_ALT7   | PIN_PORTD | PIN4)
#define PIN_SPI1_PCS1_1           (PIN_ALT2   | PIN_PORTB | PIN9)
#define PIN_SPI1_PCS1_2           (PIN_ALT2   | PIN_PORTE | PIN0)
#define PIN_SPI1_PCS2             (PIN_ALT2   | PIN_PORTE | PIN5)
#define PIN_SPI1_PCS3             (PIN_ALT2   | PIN_PORTE | PIN6)
#define PIN_SPI1_SCK_1            (PIN_ALT2   | PIN_PORTB | PIN11)
#define PIN_SPI1_SCK_2            (PIN_ALT2   | PIN_PORTE | PIN2)
#define PIN_SPI1_SCK_3            (PIN_ALT7   | PIN_PORTD | PIN5)
#define PIN_SPI1_SIN_1            (PIN_ALT2   | PIN_PORTB | PIN17)
#define PIN_SPI1_SIN_2            (PIN_ALT2   | PIN_PORTE | PIN3)
#define PIN_SPI1_SIN_3            (PIN_ALT7   | PIN_PORTD | PIN7)
#define PIN_SPI1_SIN_4            (PIN_ALT7   | PIN_PORTE | PIN1)
#define PIN_SPI1_SOUT_1           (PIN_ALT2   | PIN_PORTB | PIN16)
#define PIN_SPI1_SOUT_2           (PIN_ALT2   | PIN_PORTE | PIN1)
#define PIN_SPI1_SOUT_3           (PIN_ALT7   | PIN_PORTD | PIN6)
#define PIN_SPI1_SOUT_4           (PIN_ALT7   | PIN_PORTE | PIN3)

#define PIN_SPI2_PCS0_1           (PIN_ALT2   | PIN_PORTB | PIN20)
#define PIN_SPI2_PCS0_2           (PIN_ALT2   | PIN_PORTD | PIN11)
#define PIN_SPI2_PCS1             (PIN_ALT2   | PIN_PORTD | PIN15)
#define PIN_SPI2_SCK_1            (PIN_ALT2   | PIN_PORTB | PIN21)
#define PIN_SPI2_SCK_2            (PIN_ALT2   | PIN_PORTD | PIN12)
#define PIN_SPI2_SIN_1            (PIN_ALT2   | PIN_PORTB | PIN23)
#define PIN_SPI2_SIN_2            (PIN_ALT2   | PIN_PORTD | PIN14)
#define PIN_SPI2_SOUT_1           (PIN_ALT2   | PIN_PORTB | PIN22)
#define PIN_SPI2_SOUT_2           (PIN_ALT2   | PIN_PORTD | PIN13)

/* SWD */

#define PIN_SWD_CLK               (PIN_ALT7   | PIN_PORTA | PIN0)
#define PIN_SWD_DIO               (PIN_ALT7   | PIN_PORTA | PIN3)

/* Trace */

#define PIN_TRACE_CLKOUT_1        (PIN_ALT5   | PIN_PORTE | PIN0)
#define PIN_TRACE_CLKOUT_2        (PIN_ALT7   | PIN_PORTA | PIN6)
#define PIN_TRACE_D0_1            (PIN_ALT5   | PIN_PORTE | PIN4)
#define PIN_TRACE_D0_2            (PIN_ALT7   | PIN_PORTA | PIN10)
#define PIN_TRACE_D1_1            (PIN_ALT5   | PIN_PORTE | PIN3)
#define PIN_TRACE_D1_2            (PIN_ALT7   | PIN_PORTA | PIN9)
#define PIN_TRACE_D2_1            (PIN_ALT5   | PIN_PORTE | PIN2)
#define PIN_TRACE_D2_2            (PIN_ALT7   | PIN_PORTA | PIN8)
#define PIN_TRACE_D3_1            (PIN_ALT5   | PIN_PORTE | PIN1)
#define PIN_TRACE_D3_2            (PIN_ALT7   | PIN_PORTA | PIN7)
#define PIN_TRACE_SWO             (PIN_ALT7   | PIN_PORTA | PIN2)

/* UARTs */

#define PIN_UART0_COL_1           (PIN_ALT2   | PIN_PORTA | PIN0)
#define PIN_UART0_COL_2           (PIN_ALT3   | PIN_PORTA | PIN16)
#define PIN_UART0_COL_3           (PIN_ALT3   | PIN_PORTB | PIN3)
#define PIN_UART0_COL_4           (PIN_ALT3   | PIN_PORTD | PIN5)
#define PIN_UART0_CTS_1           (PIN_ALT2   | PIN_PORTA | PIN0)
#define PIN_UART0_CTS_2           (PIN_ALT3   | PIN_PORTA | PIN16)
#define PIN_UART0_CTS_3           (PIN_ALT3   | PIN_PORTB | PIN3)
#define PIN_UART0_CTS_4           (PIN_ALT3   | PIN_PORTD | PIN5)
#define PIN_UART0_RTS_1           (PIN_ALT2   | PIN_PORTA | PIN3)
#define PIN_UART0_RTS_2           (PIN_ALT3   | PIN_PORTA | PIN17)
#define PIN_UART0_RTS_3           (PIN_ALT3   | PIN_PORTB | PIN2)
#define PIN_UART0_RTS_4           (PIN_ALT3   | PIN_PORTD | PIN4)
#define PIN_UART0_RX_1            (PIN_ALT2   | PIN_PORTA | PIN1)
#define PIN_UART0_RX_2            (PIN_ALT3   | PIN_PORTA | PIN15)
#define PIN_UART0_RX_3            (PIN_ALT3   | PIN_PORTB | PIN16)
#define PIN_UART0_RX_4            (PIN_ALT3   | PIN_PORTD | PIN6)
#define PIN_UART0_TX_1            (PIN_ALT2   | PIN_PORTA | PIN2)
#define PIN_UART0_TX_2            (PIN_ALT3   | PIN_PORTA | PIN14)
#define PIN_UART0_TX_3            (PIN_ALT3   | PIN_PORTB | PIN17)
#define PIN_UART0_TX_4            (PIN_ALT3   | PIN_PORTD | PIN7)

#define PIN_UART1_CTS_1           (PIN_ALT3   | PIN_PORTC | PIN2)
#define PIN_UART1_CTS_2           (PIN_ALT3   | PIN_PORTE | PIN2)
#define PIN_UART1_RTS_1           (PIN_ALT3   | PIN_PORTC | PIN1)
#define PIN_UART1_RTS_2           (PIN_ALT3   | PIN_PORTE | PIN3)
#define PIN_UART1_RX_1            (PIN_ALT3   | PIN_PORTC | PIN3)
#define PIN_UART1_RX_2            (PIN_ALT3   | PIN_PORTE | PIN1)
#define PIN_UART1_TX_1            (PIN_ALT3   | PIN_PORTC | PIN4)
#define PIN_UART1_TX_2            (PIN_ALT3   | PIN_PORTE | PIN0)

#define PIN_UART2_CTS             (PIN_ALT3   | PIN_PORTD | PIN1)
#if !defined(PIN_UART2_RTS)
#  define PIN_UART2_RTS           (PIN_ALT3   | PIN_PORTD | PIN0)
#endif
#define PIN_UART2_RX              (PIN_ALT3   | PIN_PORTD | PIN2)
#define PIN_UART2_TX              (PIN_ALT3   | PIN_PORTD | PIN3)

