apache/nuttx/arch/arm/src/kinetis/hardware/kinetis_k64pinmux.h
#define PIN_UART3_CTS_1           (PIN_ALT2   | PIN_PORTB | PIN13)
#define PIN_UART3_CTS_2           (PIN_ALT3   | PIN_PORTB | PIN9)
#define PIN_UART3_CTS_3           (PIN_ALT3   | PIN_PORTC | PIN19)
#define PIN_UART3_CTS_4           (PIN_ALT3   | PIN_PORTE | PIN6)
#define PIN_UART3_RTS_1           (PIN_ALT2   | PIN_PORTB | PIN12)
#define PIN_UART3_RTS_2           (PIN_ALT3   | PIN_PORTB | PIN8)
#define PIN_UART3_RTS_3           (PIN_ALT3   | PIN_PORTC | PIN18)
#define PIN_UART3_RTS_4           (PIN_ALT3   | PIN_PORTE | PIN7)
#define PIN_UART3_RX_1            (PIN_ALT3   | PIN_PORTB | PIN10)
#define PIN_UART3_RX_2            (PIN_ALT3   | PIN_PORTC | PIN16)
#define PIN_UART3_RX_3            (PIN_ALT3   | PIN_PORTE | PIN5)
#define PIN_UART3_TX_1            (PIN_ALT3   | PIN_PORTB | PIN11)
#define PIN_UART3_TX_2            (PIN_ALT3   | PIN_PORTC | PIN17)
#define PIN_UART3_TX_3            (PIN_ALT3   | PIN_PORTE | PIN4)

#define PIN_UART4_CTS_1           (PIN_ALT3   | PIN_PORTC | PIN13)
#define PIN_UART4_CTS_2           (PIN_ALT3   | PIN_PORTE | PIN26)
#define PIN_UART4_RTS_1           (PIN_ALT3   | PIN_PORTC | PIN12)
#define PIN_UART4_RTS_2           (PIN_ALT3   | PIN_PORTE | PIN27)
#define PIN_UART4_RX_1            (PIN_ALT3   | PIN_PORTC | PIN14)
#define PIN_UART4_RX_2            (PIN_ALT3   | PIN_PORTE | PIN25)
#define PIN_UART4_TX_1            (PIN_ALT3   | PIN_PORTC | PIN15)
#define PIN_UART4_TX_2            (PIN_ALT3   | PIN_PORTE | PIN24)

#define PIN_UART5_CTS_1           (PIN_ALT3   | PIN_PORTD | PIN11)
#define PIN_UART5_CTS_2           (PIN_ALT3   | PIN_PORTE | PIN10)
#define PIN_UART5_RTS_1           (PIN_ALT3   | PIN_PORTD | PIN10)
#define PIN_UART5_RTS_2           (PIN_ALT3   | PIN_PORTE | PIN11)
#define PIN_UART5_RX_1            (PIN_ALT3   | PIN_PORTD | PIN8)
#define PIN_UART5_RX_2            (PIN_ALT3   | PIN_PORTE | PIN9)
#define PIN_UART5_TX_1            (PIN_ALT3   | PIN_PORTD | PIN9)
#define PIN_UART5_TX_2            (PIN_ALT3   | PIN_PORTE | PIN8)

/* USB */

#define PIN_USB_CLKIN_1           (PIN_ALT2   | PIN_PORTA | PIN5)
#define PIN_USB_CLKIN_2           (PIN_ALT7   | PIN_PORTE | PIN26)
#define PIN_USB_SOF_OUT_1         (PIN_ALT3   | PIN_PORTC | PIN7)
#define PIN_USB_SOF_OUT_2         (PIN_ALT4   | PIN_PORTC | PIN0)
#define PIN_USB_SOF_OUT_3         (PIN_ALT7   | PIN_PORTE | PIN6)

/* External Crystal */

#define PIN_EXTAL0                (PIN_ANALOG | PIN_PORTA | PIN18)
#define PIN_XTAL0                 (PIN_ANALOG | PIN_PORTA | PIN19)

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Functions Prototypes
 ****************************************************************************/

#endif /* KINETIS_K64 */
#endif /* __ARCH_ARM_SRC_KINETIS_HARDWARE_KINETIS_K64PINMUX_H */
